GopalSaraf/Practicals/PSDL/include/proc/pic18f26q10.inc
// Register: CLCIN6PPS
#define CLCIN6PPS CLCIN6PPS
CLCIN6PPS                                equ 0E25h
// bitfield definitions
CLCIN6PPS_PIN_POSN                       equ 0000h
CLCIN6PPS_PIN_POSITION                   equ 0000h
CLCIN6PPS_PIN_SIZE                       equ 0003h
CLCIN6PPS_PIN_LENGTH                     equ 0003h
CLCIN6PPS_PIN_MASK                       equ 0007h
CLCIN6PPS_PORT_POSN                      equ 0003h
CLCIN6PPS_PORT_POSITION                  equ 0003h
CLCIN6PPS_PORT_SIZE                      equ 0002h
CLCIN6PPS_PORT_LENGTH                    equ 0002h
CLCIN6PPS_PORT_MASK                      equ 0018h
CLCIN6PPS_CLCIN6PPS0_POSN                equ 0000h
CLCIN6PPS_CLCIN6PPS0_POSITION            equ 0000h
CLCIN6PPS_CLCIN6PPS0_SIZE                equ 0001h
CLCIN6PPS_CLCIN6PPS0_LENGTH              equ 0001h
CLCIN6PPS_CLCIN6PPS0_MASK                equ 0001h
CLCIN6PPS_CLCIN6PPS1_POSN                equ 0001h
CLCIN6PPS_CLCIN6PPS1_POSITION            equ 0001h
CLCIN6PPS_CLCIN6PPS1_SIZE                equ 0001h
CLCIN6PPS_CLCIN6PPS1_LENGTH              equ 0001h
CLCIN6PPS_CLCIN6PPS1_MASK                equ 0002h
CLCIN6PPS_CLCIN6PPS2_POSN                equ 0002h
CLCIN6PPS_CLCIN6PPS2_POSITION            equ 0002h
CLCIN6PPS_CLCIN6PPS2_SIZE                equ 0001h
CLCIN6PPS_CLCIN6PPS2_LENGTH              equ 0001h
CLCIN6PPS_CLCIN6PPS2_MASK                equ 0004h
CLCIN6PPS_CLCIN6PPS3_POSN                equ 0003h
CLCIN6PPS_CLCIN6PPS3_POSITION            equ 0003h
CLCIN6PPS_CLCIN6PPS3_SIZE                equ 0001h
CLCIN6PPS_CLCIN6PPS3_LENGTH              equ 0001h
CLCIN6PPS_CLCIN6PPS3_MASK                equ 0008h
CLCIN6PPS_CLCIN6PPS4_POSN                equ 0004h
CLCIN6PPS_CLCIN6PPS4_POSITION            equ 0004h
CLCIN6PPS_CLCIN6PPS4_SIZE                equ 0001h
CLCIN6PPS_CLCIN6PPS4_LENGTH              equ 0001h
CLCIN6PPS_CLCIN6PPS4_MASK                equ 0010h
CLCIN6PPS_CLCIN6PPS_POSN                 equ 0000h
CLCIN6PPS_CLCIN6PPS_POSITION             equ 0000h
CLCIN6PPS_CLCIN6PPS_SIZE                 equ 0005h
CLCIN6PPS_CLCIN6PPS_LENGTH               equ 0005h
CLCIN6PPS_CLCIN6PPS_MASK                 equ 001Fh

// Register: CLCIN7PPS
#define CLCIN7PPS CLCIN7PPS
CLCIN7PPS                                equ 0E26h
// bitfield definitions
CLCIN7PPS_PIN_POSN                       equ 0000h
CLCIN7PPS_PIN_POSITION                   equ 0000h
CLCIN7PPS_PIN_SIZE                       equ 0003h
CLCIN7PPS_PIN_LENGTH                     equ 0003h
CLCIN7PPS_PIN_MASK                       equ 0007h
CLCIN7PPS_PORT_POSN                      equ 0003h
CLCIN7PPS_PORT_POSITION                  equ 0003h
CLCIN7PPS_PORT_SIZE                      equ 0002h
CLCIN7PPS_PORT_LENGTH                    equ 0002h
CLCIN7PPS_PORT_MASK                      equ 0018h
CLCIN7PPS_CLCIN7PPS0_POSN                equ 0000h
CLCIN7PPS_CLCIN7PPS0_POSITION            equ 0000h
CLCIN7PPS_CLCIN7PPS0_SIZE                equ 0001h
CLCIN7PPS_CLCIN7PPS0_LENGTH              equ 0001h
CLCIN7PPS_CLCIN7PPS0_MASK                equ 0001h
CLCIN7PPS_CLCIN7PPS1_POSN                equ 0001h
CLCIN7PPS_CLCIN7PPS1_POSITION            equ 0001h
CLCIN7PPS_CLCIN7PPS1_SIZE                equ 0001h
CLCIN7PPS_CLCIN7PPS1_LENGTH              equ 0001h
CLCIN7PPS_CLCIN7PPS1_MASK                equ 0002h
CLCIN7PPS_CLCIN7PPS2_POSN                equ 0002h
CLCIN7PPS_CLCIN7PPS2_POSITION            equ 0002h
CLCIN7PPS_CLCIN7PPS2_SIZE                equ 0001h
CLCIN7PPS_CLCIN7PPS2_LENGTH              equ 0001h
CLCIN7PPS_CLCIN7PPS2_MASK                equ 0004h
CLCIN7PPS_CLCIN7PPS3_POSN                equ 0003h
CLCIN7PPS_CLCIN7PPS3_POSITION            equ 0003h
CLCIN7PPS_CLCIN7PPS3_SIZE                equ 0001h
CLCIN7PPS_CLCIN7PPS3_LENGTH              equ 0001h
CLCIN7PPS_CLCIN7PPS3_MASK                equ 0008h
CLCIN7PPS_CLCIN7PPS4_POSN                equ 0004h
CLCIN7PPS_CLCIN7PPS4_POSITION            equ 0004h
CLCIN7PPS_CLCIN7PPS4_SIZE                equ 0001h
CLCIN7PPS_CLCIN7PPS4_LENGTH              equ 0001h
CLCIN7PPS_CLCIN7PPS4_MASK                equ 0010h
CLCIN7PPS_CLCIN7PPS_POSN                 equ 0000h
CLCIN7PPS_CLCIN7PPS_POSITION             equ 0000h
CLCIN7PPS_CLCIN7PPS_SIZE                 equ 0005h
CLCIN7PPS_CLCIN7PPS_LENGTH               equ 0005h
CLCIN7PPS_CLCIN7PPS_MASK                 equ 001Fh

// Register: CLC1CON
#define CLC1CON CLC1CON
CLC1CON                                  equ 0E27h
// bitfield definitions
CLC1CON_MODE_POSN                        equ 0000h
CLC1CON_MODE_POSITION                    equ 0000h
CLC1CON_MODE_SIZE                        equ 0003h
CLC1CON_MODE_LENGTH                      equ 0003h
CLC1CON_MODE_MASK                        equ 0007h
CLC1CON_INTN_POSN                        equ 0003h
CLC1CON_INTN_POSITION                    equ 0003h
CLC1CON_INTN_SIZE                        equ 0001h
CLC1CON_INTN_LENGTH                      equ 0001h
CLC1CON_INTN_MASK                        equ 0008h
CLC1CON_INTP_POSN                        equ 0004h
CLC1CON_INTP_POSITION                    equ 0004h
CLC1CON_INTP_SIZE                        equ 0001h
CLC1CON_INTP_LENGTH                      equ 0001h
CLC1CON_INTP_MASK                        equ 0010h
CLC1CON_OUT_POSN                         equ 0005h
CLC1CON_OUT_POSITION                     equ 0005h
CLC1CON_OUT_SIZE                         equ 0001h
CLC1CON_OUT_LENGTH                       equ 0001h
CLC1CON_OUT_MASK                         equ 0020h
CLC1CON_EN_POSN                          equ 0007h
CLC1CON_EN_POSITION                      equ 0007h
CLC1CON_EN_SIZE                          equ 0001h
CLC1CON_EN_LENGTH                        equ 0001h
CLC1CON_EN_MASK                          equ 0080h
CLC1CON_MODE0_POSN                       equ 0000h
CLC1CON_MODE0_POSITION                   equ 0000h
CLC1CON_MODE0_SIZE                       equ 0001h
CLC1CON_MODE0_LENGTH                     equ 0001h
CLC1CON_MODE0_MASK                       equ 0001h
CLC1CON_MODE1_POSN                       equ 0001h
CLC1CON_MODE1_POSITION                   equ 0001h
CLC1CON_MODE1_SIZE                       equ 0001h
CLC1CON_MODE1_LENGTH                     equ 0001h
CLC1CON_MODE1_MASK                       equ 0002h
CLC1CON_MODE2_POSN                       equ 0002h
CLC1CON_MODE2_POSITION                   equ 0002h
CLC1CON_MODE2_SIZE                       equ 0001h
CLC1CON_MODE2_LENGTH                     equ 0001h
CLC1CON_MODE2_MASK                       equ 0004h
CLC1CON_LC1MODE_POSN                     equ 0000h
CLC1CON_LC1MODE_POSITION                 equ 0000h
CLC1CON_LC1MODE_SIZE                     equ 0003h
CLC1CON_LC1MODE_LENGTH                   equ 0003h
CLC1CON_LC1MODE_MASK                     equ 0007h
CLC1CON_LC1INTN_POSN                     equ 0003h
CLC1CON_LC1INTN_POSITION                 equ 0003h
CLC1CON_LC1INTN_SIZE                     equ 0001h
CLC1CON_LC1INTN_LENGTH                   equ 0001h
CLC1CON_LC1INTN_MASK                     equ 0008h
CLC1CON_LC1INTP_POSN                     equ 0004h
CLC1CON_LC1INTP_POSITION                 equ 0004h
CLC1CON_LC1INTP_SIZE                     equ 0001h
CLC1CON_LC1INTP_LENGTH                   equ 0001h
CLC1CON_LC1INTP_MASK                     equ 0010h
CLC1CON_LC1OUT_POSN                      equ 0005h
CLC1CON_LC1OUT_POSITION                  equ 0005h
CLC1CON_LC1OUT_SIZE                      equ 0001h
CLC1CON_LC1OUT_LENGTH                    equ 0001h
CLC1CON_LC1OUT_MASK                      equ 0020h
CLC1CON_LC1EN_POSN                       equ 0007h
CLC1CON_LC1EN_POSITION                   equ 0007h
CLC1CON_LC1EN_SIZE                       equ 0001h
CLC1CON_LC1EN_LENGTH                     equ 0001h
CLC1CON_LC1EN_MASK                       equ 0080h
CLC1CON_LC1MODE0_POSN                    equ 0000h
CLC1CON_LC1MODE0_POSITION                equ 0000h
CLC1CON_LC1MODE0_SIZE                    equ 0001h
CLC1CON_LC1MODE0_LENGTH                  equ 0001h
CLC1CON_LC1MODE0_MASK                    equ 0001h
CLC1CON_LC1MODE1_POSN                    equ 0001h
CLC1CON_LC1MODE1_POSITION                equ 0001h
CLC1CON_LC1MODE1_SIZE                    equ 0001h
CLC1CON_LC1MODE1_LENGTH                  equ 0001h
CLC1CON_LC1MODE1_MASK                    equ 0002h
CLC1CON_LC1MODE2_POSN                    equ 0002h
CLC1CON_LC1MODE2_POSITION                equ 0002h
CLC1CON_LC1MODE2_SIZE                    equ 0001h
CLC1CON_LC1MODE2_LENGTH                  equ 0001h
CLC1CON_LC1MODE2_MASK                    equ 0004h

// Register: CLC1POL
#define CLC1POL CLC1POL
CLC1POL                                  equ 0E28h
// bitfield definitions
CLC1POL_G1POL_POSN                       equ 0000h
CLC1POL_G1POL_POSITION                   equ 0000h
CLC1POL_G1POL_SIZE                       equ 0001h
CLC1POL_G1POL_LENGTH                     equ 0001h
CLC1POL_G1POL_MASK                       equ 0001h
CLC1POL_G2POL_POSN                       equ 0001h
CLC1POL_G2POL_POSITION                   equ 0001h
CLC1POL_G2POL_SIZE                       equ 0001h
CLC1POL_G2POL_LENGTH                     equ 0001h
CLC1POL_G2POL_MASK                       equ 0002h
CLC1POL_G3POL_POSN                       equ 0002h
CLC1POL_G3POL_POSITION                   equ 0002h
CLC1POL_G3POL_SIZE                       equ 0001h
CLC1POL_G3POL_LENGTH                     equ 0001h
CLC1POL_G3POL_MASK                       equ 0004h
CLC1POL_G4POL_POSN                       equ 0003h
CLC1POL_G4POL_POSITION                   equ 0003h
CLC1POL_G4POL_SIZE                       equ 0001h
CLC1POL_G4POL_LENGTH                     equ 0001h
CLC1POL_G4POL_MASK                       equ 0008h
CLC1POL_POL_POSN                         equ 0007h
CLC1POL_POL_POSITION                     equ 0007h
CLC1POL_POL_SIZE                         equ 0001h
CLC1POL_POL_LENGTH                       equ 0001h
CLC1POL_POL_MASK                         equ 0080h
CLC1POL_LC1G1POL_POSN                    equ 0000h
CLC1POL_LC1G1POL_POSITION                equ 0000h
CLC1POL_LC1G1POL_SIZE                    equ 0001h
CLC1POL_LC1G1POL_LENGTH                  equ 0001h
CLC1POL_LC1G1POL_MASK                    equ 0001h
CLC1POL_LC1G2POL_POSN                    equ 0001h
CLC1POL_LC1G2POL_POSITION                equ 0001h
CLC1POL_LC1G2POL_SIZE                    equ 0001h
CLC1POL_LC1G2POL_LENGTH                  equ 0001h
CLC1POL_LC1G2POL_MASK                    equ 0002h
CLC1POL_LC1G3POL_POSN                    equ 0002h
CLC1POL_LC1G3POL_POSITION                equ 0002h
CLC1POL_LC1G3POL_SIZE                    equ 0001h
CLC1POL_LC1G3POL_LENGTH                  equ 0001h
CLC1POL_LC1G3POL_MASK                    equ 0004h
CLC1POL_LC1G4POL_POSN                    equ 0003h
CLC1POL_LC1G4POL_POSITION                equ 0003h
CLC1POL_LC1G4POL_SIZE                    equ 0001h
CLC1POL_LC1G4POL_LENGTH                  equ 0001h
CLC1POL_LC1G4POL_MASK                    equ 0008h
CLC1POL_LC1POL_POSN                      equ 0007h
CLC1POL_LC1POL_POSITION                  equ 0007h
CLC1POL_LC1POL_SIZE                      equ 0001h
CLC1POL_LC1POL_LENGTH                    equ 0001h
CLC1POL_LC1POL_MASK                      equ 0080h

// Register: CLC1SEL0
#define CLC1SEL0 CLC1SEL0
CLC1SEL0                                 equ 0E29h
// bitfield definitions
CLC1SEL0_D1S_POSN                        equ 0000h
CLC1SEL0_D1S_POSITION                    equ 0000h
CLC1SEL0_D1S_SIZE                        equ 0008h
CLC1SEL0_D1S_LENGTH                      equ 0008h
CLC1SEL0_D1S_MASK                        equ 00FFh
CLC1SEL0_LC1D1S_POSN                     equ 0000h
CLC1SEL0_LC1D1S_POSITION                 equ 0000h
CLC1SEL0_LC1D1S_SIZE                     equ 0008h
CLC1SEL0_LC1D1S_LENGTH                   equ 0008h
CLC1SEL0_LC1D1S_MASK                     equ 00FFh
CLC1SEL0_D1S0_POSN                       equ 0000h
CLC1SEL0_D1S0_POSITION                   equ 0000h
CLC1SEL0_D1S0_SIZE                       equ 0001h
CLC1SEL0_D1S0_LENGTH                     equ 0001h
CLC1SEL0_D1S0_MASK                       equ 0001h
CLC1SEL0_D1S1_POSN                       equ 0001h
CLC1SEL0_D1S1_POSITION                   equ 0001h
CLC1SEL0_D1S1_SIZE                       equ 0001h
CLC1SEL0_D1S1_LENGTH                     equ 0001h
CLC1SEL0_D1S1_MASK                       equ 0002h
CLC1SEL0_D1S2_POSN                       equ 0002h
CLC1SEL0_D1S2_POSITION                   equ 0002h
CLC1SEL0_D1S2_SIZE                       equ 0001h
CLC1SEL0_D1S2_LENGTH                     equ 0001h
CLC1SEL0_D1S2_MASK                       equ 0004h
CLC1SEL0_D1S3_POSN                       equ 0003h
CLC1SEL0_D1S3_POSITION                   equ 0003h
CLC1SEL0_D1S3_SIZE                       equ 0001h
CLC1SEL0_D1S3_LENGTH                     equ 0001h
CLC1SEL0_D1S3_MASK                       equ 0008h
CLC1SEL0_D1S4_POSN                       equ 0004h
CLC1SEL0_D1S4_POSITION                   equ 0004h
CLC1SEL0_D1S4_SIZE                       equ 0001h
CLC1SEL0_D1S4_LENGTH                     equ 0001h
CLC1SEL0_D1S4_MASK                       equ 0010h
CLC1SEL0_D1S5_POSN                       equ 0005h
CLC1SEL0_D1S5_POSITION                   equ 0005h
CLC1SEL0_D1S5_SIZE                       equ 0001h
CLC1SEL0_D1S5_LENGTH                     equ 0001h
CLC1SEL0_D1S5_MASK                       equ 0020h
CLC1SEL0_D1S6_POSN                       equ 0006h
CLC1SEL0_D1S6_POSITION                   equ 0006h
CLC1SEL0_D1S6_SIZE                       equ 0001h
CLC1SEL0_D1S6_LENGTH                     equ 0001h
CLC1SEL0_D1S6_MASK                       equ 0040h
CLC1SEL0_D1S7_POSN                       equ 0007h
CLC1SEL0_D1S7_POSITION                   equ 0007h
CLC1SEL0_D1S7_SIZE                       equ 0001h
CLC1SEL0_D1S7_LENGTH                     equ 0001h
CLC1SEL0_D1S7_MASK                       equ 0080h
CLC1SEL0_LC1D1S0_POSN                    equ 0000h
CLC1SEL0_LC1D1S0_POSITION                equ 0000h
CLC1SEL0_LC1D1S0_SIZE                    equ 0001h
CLC1SEL0_LC1D1S0_LENGTH                  equ 0001h
CLC1SEL0_LC1D1S0_MASK                    equ 0001h
CLC1SEL0_LC1D1S1_POSN                    equ 0001h
CLC1SEL0_LC1D1S1_POSITION                equ 0001h
CLC1SEL0_LC1D1S1_SIZE                    equ 0001h
CLC1SEL0_LC1D1S1_LENGTH                  equ 0001h
CLC1SEL0_LC1D1S1_MASK                    equ 0002h
CLC1SEL0_LC1D1S2_POSN                    equ 0002h
CLC1SEL0_LC1D1S2_POSITION                equ 0002h
CLC1SEL0_LC1D1S2_SIZE                    equ 0001h
CLC1SEL0_LC1D1S2_LENGTH                  equ 0001h
CLC1SEL0_LC1D1S2_MASK                    equ 0004h
CLC1SEL0_LC1D1S3_POSN                    equ 0003h
CLC1SEL0_LC1D1S3_POSITION                equ 0003h
CLC1SEL0_LC1D1S3_SIZE                    equ 0001h
CLC1SEL0_LC1D1S3_LENGTH                  equ 0001h
CLC1SEL0_LC1D1S3_MASK                    equ 0008h
CLC1SEL0_LC1D1S4_POSN                    equ 0004h
CLC1SEL0_LC1D1S4_POSITION                equ 0004h
CLC1SEL0_LC1D1S4_SIZE                    equ 0001h
CLC1SEL0_LC1D1S4_LENGTH                  equ 0001h
CLC1SEL0_LC1D1S4_MASK                    equ 0010h
CLC1SEL0_LC1D1S5_POSN                    equ 0005h
CLC1SEL0_LC1D1S5_POSITION                equ 0005h
CLC1SEL0_LC1D1S5_SIZE                    equ 0001h
CLC1SEL0_LC1D1S5_LENGTH                  equ 0001h
CLC1SEL0_LC1D1S5_MASK                    equ 0020h
CLC1SEL0_LC1D1S6_POSN                    equ 0006h
CLC1SEL0_LC1D1S6_POSITION                equ 0006h
CLC1SEL0_LC1D1S6_SIZE                    equ 0001h
CLC1SEL0_LC1D1S6_LENGTH                  equ 0001h
CLC1SEL0_LC1D1S6_MASK                    equ 0040h
CLC1SEL0_LC1D1S7_POSN                    equ 0007h
CLC1SEL0_LC1D1S7_POSITION                equ 0007h
CLC1SEL0_LC1D1S7_SIZE                    equ 0001h
CLC1SEL0_LC1D1S7_LENGTH                  equ 0001h
CLC1SEL0_LC1D1S7_MASK                    equ 0080h

// Register: CLC1SEL1
#define CLC1SEL1 CLC1SEL1
CLC1SEL1                                 equ 0E2Ah
// bitfield definitions
CLC1SEL1_D2S_POSN                        equ 0000h
CLC1SEL1_D2S_POSITION                    equ 0000h
CLC1SEL1_D2S_SIZE                        equ 0008h
CLC1SEL1_D2S_LENGTH                      equ 0008h
CLC1SEL1_D2S_MASK                        equ 00FFh
CLC1SEL1_LC1D2S_POSN                     equ 0000h
CLC1SEL1_LC1D2S_POSITION                 equ 0000h
CLC1SEL1_LC1D2S_SIZE                     equ 0008h
CLC1SEL1_LC1D2S_LENGTH                   equ 0008h
CLC1SEL1_LC1D2S_MASK                     equ 00FFh
CLC1SEL1_D2S0_POSN                       equ 0000h
CLC1SEL1_D2S0_POSITION                   equ 0000h
CLC1SEL1_D2S0_SIZE                       equ 0001h
CLC1SEL1_D2S0_LENGTH                     equ 0001h
CLC1SEL1_D2S0_MASK                       equ 0001h
CLC1SEL1_D2S1_POSN                       equ 0001h
CLC1SEL1_D2S1_POSITION                   equ 0001h
CLC1SEL1_D2S1_SIZE                       equ 0001h
CLC1SEL1_D2S1_LENGTH                     equ 0001h
CLC1SEL1_D2S1_MASK                       equ 0002h
CLC1SEL1_D2S2_POSN                       equ 0002h
CLC1SEL1_D2S2_POSITION                   equ 0002h
CLC1SEL1_D2S2_SIZE                       equ 0001h
CLC1SEL1_D2S2_LENGTH                     equ 0001h
CLC1SEL1_D2S2_MASK                       equ 0004h
CLC1SEL1_D2S3_POSN                       equ 0003h
CLC1SEL1_D2S3_POSITION                   equ 0003h
CLC1SEL1_D2S3_SIZE                       equ 0001h
CLC1SEL1_D2S3_LENGTH                     equ 0001h
CLC1SEL1_D2S3_MASK                       equ 0008h
CLC1SEL1_D2S4_POSN                       equ 0004h
CLC1SEL1_D2S4_POSITION                   equ 0004h
CLC1SEL1_D2S4_SIZE                       equ 0001h
CLC1SEL1_D2S4_LENGTH                     equ 0001h
CLC1SEL1_D2S4_MASK                       equ 0010h
CLC1SEL1_D2S5_POSN                       equ 0005h
CLC1SEL1_D2S5_POSITION                   equ 0005h
CLC1SEL1_D2S5_SIZE                       equ 0001h
CLC1SEL1_D2S5_LENGTH                     equ 0001h
CLC1SEL1_D2S5_MASK                       equ 0020h
CLC1SEL1_D2S6_POSN                       equ 0006h
CLC1SEL1_D2S6_POSITION                   equ 0006h
CLC1SEL1_D2S6_SIZE                       equ 0001h
CLC1SEL1_D2S6_LENGTH                     equ 0001h
CLC1SEL1_D2S6_MASK                       equ 0040h
CLC1SEL1_D2S7_POSN                       equ 0007h
CLC1SEL1_D2S7_POSITION                   equ 0007h
CLC1SEL1_D2S7_SIZE                       equ 0001h
CLC1SEL1_D2S7_LENGTH                     equ 0001h
CLC1SEL1_D2S7_MASK                       equ 0080h
CLC1SEL1_LC1D2S0_POSN                    equ 0000h
CLC1SEL1_LC1D2S0_POSITION                equ 0000h
CLC1SEL1_LC1D2S0_SIZE                    equ 0001h
CLC1SEL1_LC1D2S0_LENGTH                  equ 0001h
CLC1SEL1_LC1D2S0_MASK                    equ 0001h
CLC1SEL1_LC1D2S1_POSN                    equ 0001h
CLC1SEL1_LC1D2S1_POSITION                equ 0001h
CLC1SEL1_LC1D2S1_SIZE                    equ 0001h
CLC1SEL1_LC1D2S1_LENGTH                  equ 0001h
CLC1SEL1_LC1D2S1_MASK                    equ 0002h
CLC1SEL1_LC1D2S2_POSN                    equ 0002h
CLC1SEL1_LC1D2S2_POSITION                equ 0002h
CLC1SEL1_LC1D2S2_SIZE                    equ 0001h
CLC1SEL1_LC1D2S2_LENGTH                  equ 0001h
CLC1SEL1_LC1D2S2_MASK                    equ 0004h
CLC1SEL1_LC1D2S3_POSN                    equ 0003h
CLC1SEL1_LC1D2S3_POSITION                equ 0003h
CLC1SEL1_LC1D2S3_SIZE                    equ 0001h
CLC1SEL1_LC1D2S3_LENGTH                  equ 0001h
CLC1SEL1_LC1D2S3_MASK                    equ 0008h
CLC1SEL1_LC1D2S4_POSN                    equ 0004h
CLC1SEL1_LC1D2S4_POSITION                equ 0004h
CLC1SEL1_LC1D2S4_SIZE                    equ 0001h
CLC1SEL1_LC1D2S4_LENGTH                  equ 0001h
CLC1SEL1_LC1D2S4_MASK                    equ 0010h
CLC1SEL1_LC1D2S5_POSN                    equ 0005h
CLC1SEL1_LC1D2S5_POSITION                equ 0005h
CLC1SEL1_LC1D2S5_SIZE                    equ 0001h
CLC1SEL1_LC1D2S5_LENGTH                  equ 0001h
CLC1SEL1_LC1D2S5_MASK                    equ 0020h
CLC1SEL1_LC1D2S6_POSN                    equ 0006h
CLC1SEL1_LC1D2S6_POSITION                equ 0006h
CLC1SEL1_LC1D2S6_SIZE                    equ 0001h
CLC1SEL1_LC1D2S6_LENGTH                  equ 0001h
CLC1SEL1_LC1D2S6_MASK                    equ 0040h
CLC1SEL1_LC1D2S7_POSN                    equ 0007h
CLC1SEL1_LC1D2S7_POSITION                equ 0007h
CLC1SEL1_LC1D2S7_SIZE                    equ 0001h
CLC1SEL1_LC1D2S7_LENGTH                  equ 0001h
CLC1SEL1_LC1D2S7_MASK                    equ 0080h

