GopalSaraf/Practicals/PSDL/include/proc/pic18f26q10.inc
// Register: CLC7GLS2
#define CLC7GLS2 CLC7GLS2
CLC7GLS2                                 equ 0E6Bh
// bitfield definitions
CLC7GLS2_G3D1N_POSN                      equ 0000h
CLC7GLS2_G3D1N_POSITION                  equ 0000h
CLC7GLS2_G3D1N_SIZE                      equ 0001h
CLC7GLS2_G3D1N_LENGTH                    equ 0001h
CLC7GLS2_G3D1N_MASK                      equ 0001h
CLC7GLS2_G3D1T_POSN                      equ 0001h
CLC7GLS2_G3D1T_POSITION                  equ 0001h
CLC7GLS2_G3D1T_SIZE                      equ 0001h
CLC7GLS2_G3D1T_LENGTH                    equ 0001h
CLC7GLS2_G3D1T_MASK                      equ 0002h
CLC7GLS2_G3D2N_POSN                      equ 0002h
CLC7GLS2_G3D2N_POSITION                  equ 0002h
CLC7GLS2_G3D2N_SIZE                      equ 0001h
CLC7GLS2_G3D2N_LENGTH                    equ 0001h
CLC7GLS2_G3D2N_MASK                      equ 0004h
CLC7GLS2_G3D2T_POSN                      equ 0003h
CLC7GLS2_G3D2T_POSITION                  equ 0003h
CLC7GLS2_G3D2T_SIZE                      equ 0001h
CLC7GLS2_G3D2T_LENGTH                    equ 0001h
CLC7GLS2_G3D2T_MASK                      equ 0008h
CLC7GLS2_G3D3N_POSN                      equ 0004h
CLC7GLS2_G3D3N_POSITION                  equ 0004h
CLC7GLS2_G3D3N_SIZE                      equ 0001h
CLC7GLS2_G3D3N_LENGTH                    equ 0001h
CLC7GLS2_G3D3N_MASK                      equ 0010h
CLC7GLS2_G3D3T_POSN                      equ 0005h
CLC7GLS2_G3D3T_POSITION                  equ 0005h
CLC7GLS2_G3D3T_SIZE                      equ 0001h
CLC7GLS2_G3D3T_LENGTH                    equ 0001h
CLC7GLS2_G3D3T_MASK                      equ 0020h
CLC7GLS2_G3D4N_POSN                      equ 0006h
CLC7GLS2_G3D4N_POSITION                  equ 0006h
CLC7GLS2_G3D4N_SIZE                      equ 0001h
CLC7GLS2_G3D4N_LENGTH                    equ 0001h
CLC7GLS2_G3D4N_MASK                      equ 0040h
CLC7GLS2_G3D4T_POSN                      equ 0007h
CLC7GLS2_G3D4T_POSITION                  equ 0007h
CLC7GLS2_G3D4T_SIZE                      equ 0001h
CLC7GLS2_G3D4T_LENGTH                    equ 0001h
CLC7GLS2_G3D4T_MASK                      equ 0080h
CLC7GLS2_LC7G3D1N_POSN                   equ 0000h
CLC7GLS2_LC7G3D1N_POSITION               equ 0000h
CLC7GLS2_LC7G3D1N_SIZE                   equ 0001h
CLC7GLS2_LC7G3D1N_LENGTH                 equ 0001h
CLC7GLS2_LC7G3D1N_MASK                   equ 0001h
CLC7GLS2_LC7G3D1T_POSN                   equ 0001h
CLC7GLS2_LC7G3D1T_POSITION               equ 0001h
CLC7GLS2_LC7G3D1T_SIZE                   equ 0001h
CLC7GLS2_LC7G3D1T_LENGTH                 equ 0001h
CLC7GLS2_LC7G3D1T_MASK                   equ 0002h
CLC7GLS2_LC7G3D2N_POSN                   equ 0002h
CLC7GLS2_LC7G3D2N_POSITION               equ 0002h
CLC7GLS2_LC7G3D2N_SIZE                   equ 0001h
CLC7GLS2_LC7G3D2N_LENGTH                 equ 0001h
CLC7GLS2_LC7G3D2N_MASK                   equ 0004h
CLC7GLS2_LC7G3D2T_POSN                   equ 0003h
CLC7GLS2_LC7G3D2T_POSITION               equ 0003h
CLC7GLS2_LC7G3D2T_SIZE                   equ 0001h
CLC7GLS2_LC7G3D2T_LENGTH                 equ 0001h
CLC7GLS2_LC7G3D2T_MASK                   equ 0008h
CLC7GLS2_LC7G3D3N_POSN                   equ 0004h
CLC7GLS2_LC7G3D3N_POSITION               equ 0004h
CLC7GLS2_LC7G3D3N_SIZE                   equ 0001h
CLC7GLS2_LC7G3D3N_LENGTH                 equ 0001h
CLC7GLS2_LC7G3D3N_MASK                   equ 0010h
CLC7GLS2_LC7G3D3T_POSN                   equ 0005h
CLC7GLS2_LC7G3D3T_POSITION               equ 0005h
CLC7GLS2_LC7G3D3T_SIZE                   equ 0001h
CLC7GLS2_LC7G3D3T_LENGTH                 equ 0001h
CLC7GLS2_LC7G3D3T_MASK                   equ 0020h
CLC7GLS2_LC7G3D4N_POSN                   equ 0006h
CLC7GLS2_LC7G3D4N_POSITION               equ 0006h
CLC7GLS2_LC7G3D4N_SIZE                   equ 0001h
CLC7GLS2_LC7G3D4N_LENGTH                 equ 0001h
CLC7GLS2_LC7G3D4N_MASK                   equ 0040h
CLC7GLS2_LC7G3D4T_POSN                   equ 0007h
CLC7GLS2_LC7G3D4T_POSITION               equ 0007h
CLC7GLS2_LC7G3D4T_SIZE                   equ 0001h
CLC7GLS2_LC7G3D4T_LENGTH                 equ 0001h
CLC7GLS2_LC7G3D4T_MASK                   equ 0080h

// Register: CLC7GLS3
#define CLC7GLS3 CLC7GLS3
CLC7GLS3                                 equ 0E6Ch
// bitfield definitions
CLC7GLS3_G4D1N_POSN                      equ 0000h
CLC7GLS3_G4D1N_POSITION                  equ 0000h
CLC7GLS3_G4D1N_SIZE                      equ 0001h
CLC7GLS3_G4D1N_LENGTH                    equ 0001h
CLC7GLS3_G4D1N_MASK                      equ 0001h
CLC7GLS3_G4D1T_POSN                      equ 0001h
CLC7GLS3_G4D1T_POSITION                  equ 0001h
CLC7GLS3_G4D1T_SIZE                      equ 0001h
CLC7GLS3_G4D1T_LENGTH                    equ 0001h
CLC7GLS3_G4D1T_MASK                      equ 0002h
CLC7GLS3_G4D2N_POSN                      equ 0002h
CLC7GLS3_G4D2N_POSITION                  equ 0002h
CLC7GLS3_G4D2N_SIZE                      equ 0001h
CLC7GLS3_G4D2N_LENGTH                    equ 0001h
CLC7GLS3_G4D2N_MASK                      equ 0004h
CLC7GLS3_G4D2T_POSN                      equ 0003h
CLC7GLS3_G4D2T_POSITION                  equ 0003h
CLC7GLS3_G4D2T_SIZE                      equ 0001h
CLC7GLS3_G4D2T_LENGTH                    equ 0001h
CLC7GLS3_G4D2T_MASK                      equ 0008h
CLC7GLS3_G4D3N_POSN                      equ 0004h
CLC7GLS3_G4D3N_POSITION                  equ 0004h
CLC7GLS3_G4D3N_SIZE                      equ 0001h
CLC7GLS3_G4D3N_LENGTH                    equ 0001h
CLC7GLS3_G4D3N_MASK                      equ 0010h
CLC7GLS3_G4D3T_POSN                      equ 0005h
CLC7GLS3_G4D3T_POSITION                  equ 0005h
CLC7GLS3_G4D3T_SIZE                      equ 0001h
CLC7GLS3_G4D3T_LENGTH                    equ 0001h
CLC7GLS3_G4D3T_MASK                      equ 0020h
CLC7GLS3_G4D4N_POSN                      equ 0006h
CLC7GLS3_G4D4N_POSITION                  equ 0006h
CLC7GLS3_G4D4N_SIZE                      equ 0001h
CLC7GLS3_G4D4N_LENGTH                    equ 0001h
CLC7GLS3_G4D4N_MASK                      equ 0040h
CLC7GLS3_G4D4T_POSN                      equ 0007h
CLC7GLS3_G4D4T_POSITION                  equ 0007h
CLC7GLS3_G4D4T_SIZE                      equ 0001h
CLC7GLS3_G4D4T_LENGTH                    equ 0001h
CLC7GLS3_G4D4T_MASK                      equ 0080h
CLC7GLS3_LC7G4D1N_POSN                   equ 0000h
CLC7GLS3_LC7G4D1N_POSITION               equ 0000h
CLC7GLS3_LC7G4D1N_SIZE                   equ 0001h
CLC7GLS3_LC7G4D1N_LENGTH                 equ 0001h
CLC7GLS3_LC7G4D1N_MASK                   equ 0001h
CLC7GLS3_LC7G4D1T_POSN                   equ 0001h
CLC7GLS3_LC7G4D1T_POSITION               equ 0001h
CLC7GLS3_LC7G4D1T_SIZE                   equ 0001h
CLC7GLS3_LC7G4D1T_LENGTH                 equ 0001h
CLC7GLS3_LC7G4D1T_MASK                   equ 0002h
CLC7GLS3_LC7G4D2N_POSN                   equ 0002h
CLC7GLS3_LC7G4D2N_POSITION               equ 0002h
CLC7GLS3_LC7G4D2N_SIZE                   equ 0001h
CLC7GLS3_LC7G4D2N_LENGTH                 equ 0001h
CLC7GLS3_LC7G4D2N_MASK                   equ 0004h
CLC7GLS3_LC7G4D2T_POSN                   equ 0003h
CLC7GLS3_LC7G4D2T_POSITION               equ 0003h
CLC7GLS3_LC7G4D2T_SIZE                   equ 0001h
CLC7GLS3_LC7G4D2T_LENGTH                 equ 0001h
CLC7GLS3_LC7G4D2T_MASK                   equ 0008h
CLC7GLS3_LC7G4D3N_POSN                   equ 0004h
CLC7GLS3_LC7G4D3N_POSITION               equ 0004h
CLC7GLS3_LC7G4D3N_SIZE                   equ 0001h
CLC7GLS3_LC7G4D3N_LENGTH                 equ 0001h
CLC7GLS3_LC7G4D3N_MASK                   equ 0010h
CLC7GLS3_LC7G4D3T_POSN                   equ 0005h
CLC7GLS3_LC7G4D3T_POSITION               equ 0005h
CLC7GLS3_LC7G4D3T_SIZE                   equ 0001h
CLC7GLS3_LC7G4D3T_LENGTH                 equ 0001h
CLC7GLS3_LC7G4D3T_MASK                   equ 0020h
CLC7GLS3_LC7G4D4N_POSN                   equ 0006h
CLC7GLS3_LC7G4D4N_POSITION               equ 0006h
CLC7GLS3_LC7G4D4N_SIZE                   equ 0001h
CLC7GLS3_LC7G4D4N_LENGTH                 equ 0001h
CLC7GLS3_LC7G4D4N_MASK                   equ 0040h
CLC7GLS3_LC7G4D4T_POSN                   equ 0007h
CLC7GLS3_LC7G4D4T_POSITION               equ 0007h
CLC7GLS3_LC7G4D4T_SIZE                   equ 0001h
CLC7GLS3_LC7G4D4T_LENGTH                 equ 0001h
CLC7GLS3_LC7G4D4T_MASK                   equ 0080h

// Register: CLC8CON
#define CLC8CON CLC8CON
CLC8CON                                  equ 0E6Dh
// bitfield definitions
CLC8CON_MODE_POSN                        equ 0000h
CLC8CON_MODE_POSITION                    equ 0000h
CLC8CON_MODE_SIZE                        equ 0003h
CLC8CON_MODE_LENGTH                      equ 0003h
CLC8CON_MODE_MASK                        equ 0007h
CLC8CON_INTN_POSN                        equ 0003h
CLC8CON_INTN_POSITION                    equ 0003h
CLC8CON_INTN_SIZE                        equ 0001h
CLC8CON_INTN_LENGTH                      equ 0001h
CLC8CON_INTN_MASK                        equ 0008h
CLC8CON_INTP_POSN                        equ 0004h
CLC8CON_INTP_POSITION                    equ 0004h
CLC8CON_INTP_SIZE                        equ 0001h
CLC8CON_INTP_LENGTH                      equ 0001h
CLC8CON_INTP_MASK                        equ 0010h
CLC8CON_OUT_POSN                         equ 0005h
CLC8CON_OUT_POSITION                     equ 0005h
CLC8CON_OUT_SIZE                         equ 0001h
CLC8CON_OUT_LENGTH                       equ 0001h
CLC8CON_OUT_MASK                         equ 0020h
CLC8CON_EN_POSN                          equ 0007h
CLC8CON_EN_POSITION                      equ 0007h
CLC8CON_EN_SIZE                          equ 0001h
CLC8CON_EN_LENGTH                        equ 0001h
CLC8CON_EN_MASK                          equ 0080h
CLC8CON_MODE0_POSN                       equ 0000h
CLC8CON_MODE0_POSITION                   equ 0000h
CLC8CON_MODE0_SIZE                       equ 0001h
CLC8CON_MODE0_LENGTH                     equ 0001h
CLC8CON_MODE0_MASK                       equ 0001h
CLC8CON_MODE1_POSN                       equ 0001h
CLC8CON_MODE1_POSITION                   equ 0001h
CLC8CON_MODE1_SIZE                       equ 0001h
CLC8CON_MODE1_LENGTH                     equ 0001h
CLC8CON_MODE1_MASK                       equ 0002h
CLC8CON_MODE2_POSN                       equ 0002h
CLC8CON_MODE2_POSITION                   equ 0002h
CLC8CON_MODE2_SIZE                       equ 0001h
CLC8CON_MODE2_LENGTH                     equ 0001h
CLC8CON_MODE2_MASK                       equ 0004h
CLC8CON_LC8MODE_POSN                     equ 0000h
CLC8CON_LC8MODE_POSITION                 equ 0000h
CLC8CON_LC8MODE_SIZE                     equ 0003h
CLC8CON_LC8MODE_LENGTH                   equ 0003h
CLC8CON_LC8MODE_MASK                     equ 0007h
CLC8CON_LC8INTN_POSN                     equ 0003h
CLC8CON_LC8INTN_POSITION                 equ 0003h
CLC8CON_LC8INTN_SIZE                     equ 0001h
CLC8CON_LC8INTN_LENGTH                   equ 0001h
CLC8CON_LC8INTN_MASK                     equ 0008h
CLC8CON_LC8INTP_POSN                     equ 0004h
CLC8CON_LC8INTP_POSITION                 equ 0004h
CLC8CON_LC8INTP_SIZE                     equ 0001h
CLC8CON_LC8INTP_LENGTH                   equ 0001h
CLC8CON_LC8INTP_MASK                     equ 0010h
CLC8CON_LC8OUT_POSN                      equ 0005h
CLC8CON_LC8OUT_POSITION                  equ 0005h
CLC8CON_LC8OUT_SIZE                      equ 0001h
CLC8CON_LC8OUT_LENGTH                    equ 0001h
CLC8CON_LC8OUT_MASK                      equ 0020h
CLC8CON_LC8EN_POSN                       equ 0007h
CLC8CON_LC8EN_POSITION                   equ 0007h
CLC8CON_LC8EN_SIZE                       equ 0001h
CLC8CON_LC8EN_LENGTH                     equ 0001h
CLC8CON_LC8EN_MASK                       equ 0080h
CLC8CON_LC8MODE0_POSN                    equ 0000h
CLC8CON_LC8MODE0_POSITION                equ 0000h
CLC8CON_LC8MODE0_SIZE                    equ 0001h
CLC8CON_LC8MODE0_LENGTH                  equ 0001h
CLC8CON_LC8MODE0_MASK                    equ 0001h
CLC8CON_LC8MODE1_POSN                    equ 0001h
CLC8CON_LC8MODE1_POSITION                equ 0001h
CLC8CON_LC8MODE1_SIZE                    equ 0001h
CLC8CON_LC8MODE1_LENGTH                  equ 0001h
CLC8CON_LC8MODE1_MASK                    equ 0002h
CLC8CON_LC8MODE2_POSN                    equ 0002h
CLC8CON_LC8MODE2_POSITION                equ 0002h
CLC8CON_LC8MODE2_SIZE                    equ 0001h
CLC8CON_LC8MODE2_LENGTH                  equ 0001h
CLC8CON_LC8MODE2_MASK                    equ 0004h

// Register: CLC8POL
#define CLC8POL CLC8POL
CLC8POL                                  equ 0E6Eh
// bitfield definitions
CLC8POL_G1POL_POSN                       equ 0000h
CLC8POL_G1POL_POSITION                   equ 0000h
CLC8POL_G1POL_SIZE                       equ 0001h
CLC8POL_G1POL_LENGTH                     equ 0001h
CLC8POL_G1POL_MASK                       equ 0001h
CLC8POL_G2POL_POSN                       equ 0001h
CLC8POL_G2POL_POSITION                   equ 0001h
CLC8POL_G2POL_SIZE                       equ 0001h
CLC8POL_G2POL_LENGTH                     equ 0001h
CLC8POL_G2POL_MASK                       equ 0002h
CLC8POL_G3POL_POSN                       equ 0002h
CLC8POL_G3POL_POSITION                   equ 0002h
CLC8POL_G3POL_SIZE                       equ 0001h
CLC8POL_G3POL_LENGTH                     equ 0001h
CLC8POL_G3POL_MASK                       equ 0004h
CLC8POL_G4POL_POSN                       equ 0003h
CLC8POL_G4POL_POSITION                   equ 0003h
CLC8POL_G4POL_SIZE                       equ 0001h
CLC8POL_G4POL_LENGTH                     equ 0001h
CLC8POL_G4POL_MASK                       equ 0008h
CLC8POL_POL_POSN                         equ 0007h
CLC8POL_POL_POSITION                     equ 0007h
CLC8POL_POL_SIZE                         equ 0001h
CLC8POL_POL_LENGTH                       equ 0001h
CLC8POL_POL_MASK                         equ 0080h
CLC8POL_LC8G1POL_POSN                    equ 0000h
CLC8POL_LC8G1POL_POSITION                equ 0000h
CLC8POL_LC8G1POL_SIZE                    equ 0001h
CLC8POL_LC8G1POL_LENGTH                  equ 0001h
CLC8POL_LC8G1POL_MASK                    equ 0001h
CLC8POL_LC8G2POL_POSN                    equ 0001h
CLC8POL_LC8G2POL_POSITION                equ 0001h
CLC8POL_LC8G2POL_SIZE                    equ 0001h
CLC8POL_LC8G2POL_LENGTH                  equ 0001h
CLC8POL_LC8G2POL_MASK                    equ 0002h
CLC8POL_LC8G3POL_POSN                    equ 0002h
CLC8POL_LC8G3POL_POSITION                equ 0002h
CLC8POL_LC8G3POL_SIZE                    equ 0001h
CLC8POL_LC8G3POL_LENGTH                  equ 0001h
CLC8POL_LC8G3POL_MASK                    equ 0004h
CLC8POL_LC8G4POL_POSN                    equ 0003h
CLC8POL_LC8G4POL_POSITION                equ 0003h
CLC8POL_LC8G4POL_SIZE                    equ 0001h
CLC8POL_LC8G4POL_LENGTH                  equ 0001h
CLC8POL_LC8G4POL_MASK                    equ 0008h
CLC8POL_LC8POL_POSN                      equ 0007h
CLC8POL_LC8POL_POSITION                  equ 0007h
CLC8POL_LC8POL_SIZE                      equ 0001h
CLC8POL_LC8POL_LENGTH                    equ 0001h
CLC8POL_LC8POL_MASK                      equ 0080h

