GopalSaraf/Practicals/PSDL/include/proc/pic18f26q10.inc
// Register: ADSTPTL
#define ADSTPTL ADSTPTL
ADSTPTL                                  equ 0F63h
// bitfield definitions
ADSTPTL_ADSTPTL_POSN                     equ 0000h
ADSTPTL_ADSTPTL_POSITION                 equ 0000h
ADSTPTL_ADSTPTL_SIZE                     equ 0008h
ADSTPTL_ADSTPTL_LENGTH                   equ 0008h
ADSTPTL_ADSTPTL_MASK                     equ 00FFh
ADSTPTL_ADSTPT0_POSN                     equ 0000h
ADSTPTL_ADSTPT0_POSITION                 equ 0000h
ADSTPTL_ADSTPT0_SIZE                     equ 0001h
ADSTPTL_ADSTPT0_LENGTH                   equ 0001h
ADSTPTL_ADSTPT0_MASK                     equ 0001h
ADSTPTL_ADSTPT1_POSN                     equ 0001h
ADSTPTL_ADSTPT1_POSITION                 equ 0001h
ADSTPTL_ADSTPT1_SIZE                     equ 0001h
ADSTPTL_ADSTPT1_LENGTH                   equ 0001h
ADSTPTL_ADSTPT1_MASK                     equ 0002h
ADSTPTL_ADSTPT2_POSN                     equ 0002h
ADSTPTL_ADSTPT2_POSITION                 equ 0002h
ADSTPTL_ADSTPT2_SIZE                     equ 0001h
ADSTPTL_ADSTPT2_LENGTH                   equ 0001h
ADSTPTL_ADSTPT2_MASK                     equ 0004h
ADSTPTL_ADSTPT3_POSN                     equ 0003h
ADSTPTL_ADSTPT3_POSITION                 equ 0003h
ADSTPTL_ADSTPT3_SIZE                     equ 0001h
ADSTPTL_ADSTPT3_LENGTH                   equ 0001h
ADSTPTL_ADSTPT3_MASK                     equ 0008h
ADSTPTL_ADSTPT4_POSN                     equ 0004h
ADSTPTL_ADSTPT4_POSITION                 equ 0004h
ADSTPTL_ADSTPT4_SIZE                     equ 0001h
ADSTPTL_ADSTPT4_LENGTH                   equ 0001h
ADSTPTL_ADSTPT4_MASK                     equ 0010h
ADSTPTL_ADSTPT5_POSN                     equ 0005h
ADSTPTL_ADSTPT5_POSITION                 equ 0005h
ADSTPTL_ADSTPT5_SIZE                     equ 0001h
ADSTPTL_ADSTPT5_LENGTH                   equ 0001h
ADSTPTL_ADSTPT5_MASK                     equ 0020h
ADSTPTL_ADSTPT6_POSN                     equ 0006h
ADSTPTL_ADSTPT6_POSITION                 equ 0006h
ADSTPTL_ADSTPT6_SIZE                     equ 0001h
ADSTPTL_ADSTPT6_LENGTH                   equ 0001h
ADSTPTL_ADSTPT6_MASK                     equ 0040h
ADSTPTL_ADSTPT7_POSN                     equ 0007h
ADSTPTL_ADSTPT7_POSITION                 equ 0007h
ADSTPTL_ADSTPT7_SIZE                     equ 0001h
ADSTPTL_ADSTPT7_LENGTH                   equ 0001h
ADSTPTL_ADSTPT7_MASK                     equ 0080h

// Register: ADSTPTH
#define ADSTPTH ADSTPTH
ADSTPTH                                  equ 0F64h
// bitfield definitions
ADSTPTH_ADSTPTH_POSN                     equ 0000h
ADSTPTH_ADSTPTH_POSITION                 equ 0000h
ADSTPTH_ADSTPTH_SIZE                     equ 0008h
ADSTPTH_ADSTPTH_LENGTH                   equ 0008h
ADSTPTH_ADSTPTH_MASK                     equ 00FFh
ADSTPTH_ADSTPT8_POSN                     equ 0000h
ADSTPTH_ADSTPT8_POSITION                 equ 0000h
ADSTPTH_ADSTPT8_SIZE                     equ 0001h
ADSTPTH_ADSTPT8_LENGTH                   equ 0001h
ADSTPTH_ADSTPT8_MASK                     equ 0001h
ADSTPTH_ADSTPT9_POSN                     equ 0001h
ADSTPTH_ADSTPT9_POSITION                 equ 0001h
ADSTPTH_ADSTPT9_SIZE                     equ 0001h
ADSTPTH_ADSTPT9_LENGTH                   equ 0001h
ADSTPTH_ADSTPT9_MASK                     equ 0002h
ADSTPTH_ADSTPT10_POSN                    equ 0002h
ADSTPTH_ADSTPT10_POSITION                equ 0002h
ADSTPTH_ADSTPT10_SIZE                    equ 0001h
ADSTPTH_ADSTPT10_LENGTH                  equ 0001h
ADSTPTH_ADSTPT10_MASK                    equ 0004h
ADSTPTH_ADSTPT11_POSN                    equ 0003h
ADSTPTH_ADSTPT11_POSITION                equ 0003h
ADSTPTH_ADSTPT11_SIZE                    equ 0001h
ADSTPTH_ADSTPT11_LENGTH                  equ 0001h
ADSTPTH_ADSTPT11_MASK                    equ 0008h
ADSTPTH_ADSTPT12_POSN                    equ 0004h
ADSTPTH_ADSTPT12_POSITION                equ 0004h
ADSTPTH_ADSTPT12_SIZE                    equ 0001h
ADSTPTH_ADSTPT12_LENGTH                  equ 0001h
ADSTPTH_ADSTPT12_MASK                    equ 0010h
ADSTPTH_ADSTPT13_POSN                    equ 0005h
ADSTPTH_ADSTPT13_POSITION                equ 0005h
ADSTPTH_ADSTPT13_SIZE                    equ 0001h
ADSTPTH_ADSTPT13_LENGTH                  equ 0001h
ADSTPTH_ADSTPT13_MASK                    equ 0020h
ADSTPTH_ADSTPT14_POSN                    equ 0006h
ADSTPTH_ADSTPT14_POSITION                equ 0006h
ADSTPTH_ADSTPT14_SIZE                    equ 0001h
ADSTPTH_ADSTPT14_LENGTH                  equ 0001h
ADSTPTH_ADSTPT14_MASK                    equ 0040h
ADSTPTH_ADSTPT15_POSN                    equ 0007h
ADSTPTH_ADSTPT15_POSITION                equ 0007h
ADSTPTH_ADSTPT15_SIZE                    equ 0001h
ADSTPTH_ADSTPT15_LENGTH                  equ 0001h
ADSTPTH_ADSTPT15_MASK                    equ 0080h

// Register: ADLTH
#define ADLTH ADLTH
ADLTH                                    equ 0F65h

// Register: ADLTHL
#define ADLTHL ADLTHL
ADLTHL                                   equ 0F65h
// bitfield definitions
ADLTHL_ADLTHL_POSN                       equ 0000h
ADLTHL_ADLTHL_POSITION                   equ 0000h
ADLTHL_ADLTHL_SIZE                       equ 0008h
ADLTHL_ADLTHL_LENGTH                     equ 0008h
ADLTHL_ADLTHL_MASK                       equ 00FFh
ADLTHL_ADLTH0_POSN                       equ 0000h
ADLTHL_ADLTH0_POSITION                   equ 0000h
ADLTHL_ADLTH0_SIZE                       equ 0001h
ADLTHL_ADLTH0_LENGTH                     equ 0001h
ADLTHL_ADLTH0_MASK                       equ 0001h
ADLTHL_ADLTH1_POSN                       equ 0001h
ADLTHL_ADLTH1_POSITION                   equ 0001h
ADLTHL_ADLTH1_SIZE                       equ 0001h
ADLTHL_ADLTH1_LENGTH                     equ 0001h
ADLTHL_ADLTH1_MASK                       equ 0002h
ADLTHL_ADLTH2_POSN                       equ 0002h
ADLTHL_ADLTH2_POSITION                   equ 0002h
ADLTHL_ADLTH2_SIZE                       equ 0001h
ADLTHL_ADLTH2_LENGTH                     equ 0001h
ADLTHL_ADLTH2_MASK                       equ 0004h
ADLTHL_ADLTH3_POSN                       equ 0003h
ADLTHL_ADLTH3_POSITION                   equ 0003h
ADLTHL_ADLTH3_SIZE                       equ 0001h
ADLTHL_ADLTH3_LENGTH                     equ 0001h
ADLTHL_ADLTH3_MASK                       equ 0008h
ADLTHL_ADLTH4_POSN                       equ 0004h
ADLTHL_ADLTH4_POSITION                   equ 0004h
ADLTHL_ADLTH4_SIZE                       equ 0001h
ADLTHL_ADLTH4_LENGTH                     equ 0001h
ADLTHL_ADLTH4_MASK                       equ 0010h
ADLTHL_ADLTH5_POSN                       equ 0005h
ADLTHL_ADLTH5_POSITION                   equ 0005h
ADLTHL_ADLTH5_SIZE                       equ 0001h
ADLTHL_ADLTH5_LENGTH                     equ 0001h
ADLTHL_ADLTH5_MASK                       equ 0020h
ADLTHL_ADLTH6_POSN                       equ 0006h
ADLTHL_ADLTH6_POSITION                   equ 0006h
ADLTHL_ADLTH6_SIZE                       equ 0001h
ADLTHL_ADLTH6_LENGTH                     equ 0001h
ADLTHL_ADLTH6_MASK                       equ 0040h
ADLTHL_ADLTH7_POSN                       equ 0007h
ADLTHL_ADLTH7_POSITION                   equ 0007h
ADLTHL_ADLTH7_SIZE                       equ 0001h
ADLTHL_ADLTH7_LENGTH                     equ 0001h
ADLTHL_ADLTH7_MASK                       equ 0080h

// Register: ADLTHH
#define ADLTHH ADLTHH
ADLTHH                                   equ 0F66h
// bitfield definitions
ADLTHH_ADLTHH_POSN                       equ 0000h
ADLTHH_ADLTHH_POSITION                   equ 0000h
ADLTHH_ADLTHH_SIZE                       equ 0008h
ADLTHH_ADLTHH_LENGTH                     equ 0008h
ADLTHH_ADLTHH_MASK                       equ 00FFh
ADLTHH_ADLTH8_POSN                       equ 0000h
ADLTHH_ADLTH8_POSITION                   equ 0000h
ADLTHH_ADLTH8_SIZE                       equ 0001h
ADLTHH_ADLTH8_LENGTH                     equ 0001h
ADLTHH_ADLTH8_MASK                       equ 0001h
ADLTHH_ADLTH9_POSN                       equ 0001h
ADLTHH_ADLTH9_POSITION                   equ 0001h
ADLTHH_ADLTH9_SIZE                       equ 0001h
ADLTHH_ADLTH9_LENGTH                     equ 0001h
ADLTHH_ADLTH9_MASK                       equ 0002h
ADLTHH_ADLTH10_POSN                      equ 0002h
ADLTHH_ADLTH10_POSITION                  equ 0002h
ADLTHH_ADLTH10_SIZE                      equ 0001h
ADLTHH_ADLTH10_LENGTH                    equ 0001h
ADLTHH_ADLTH10_MASK                      equ 0004h
ADLTHH_ADLTH11_POSN                      equ 0003h
ADLTHH_ADLTH11_POSITION                  equ 0003h
ADLTHH_ADLTH11_SIZE                      equ 0001h
ADLTHH_ADLTH11_LENGTH                    equ 0001h
ADLTHH_ADLTH11_MASK                      equ 0008h
ADLTHH_ADLTH12_POSN                      equ 0004h
ADLTHH_ADLTH12_POSITION                  equ 0004h
ADLTHH_ADLTH12_SIZE                      equ 0001h
ADLTHH_ADLTH12_LENGTH                    equ 0001h
ADLTHH_ADLTH12_MASK                      equ 0010h
ADLTHH_ADLTH13_POSN                      equ 0005h
ADLTHH_ADLTH13_POSITION                  equ 0005h
ADLTHH_ADLTH13_SIZE                      equ 0001h
ADLTHH_ADLTH13_LENGTH                    equ 0001h
ADLTHH_ADLTH13_MASK                      equ 0020h
ADLTHH_ADLTH14_POSN                      equ 0006h
ADLTHH_ADLTH14_POSITION                  equ 0006h
ADLTHH_ADLTH14_SIZE                      equ 0001h
ADLTHH_ADLTH14_LENGTH                    equ 0001h
ADLTHH_ADLTH14_MASK                      equ 0040h
ADLTHH_ADLTH15_POSN                      equ 0007h
ADLTHH_ADLTH15_POSITION                  equ 0007h
ADLTHH_ADLTH15_SIZE                      equ 0001h
ADLTHH_ADLTH15_LENGTH                    equ 0001h
ADLTHH_ADLTH15_MASK                      equ 0080h

// Register: ADUTH
#define ADUTH ADUTH
ADUTH                                    equ 0F67h

// Register: ADUTHL
#define ADUTHL ADUTHL
ADUTHL                                   equ 0F67h
// bitfield definitions
ADUTHL_ADUTHL_POSN                       equ 0000h
ADUTHL_ADUTHL_POSITION                   equ 0000h
ADUTHL_ADUTHL_SIZE                       equ 0008h
ADUTHL_ADUTHL_LENGTH                     equ 0008h
ADUTHL_ADUTHL_MASK                       equ 00FFh
ADUTHL_ADUTH0_POSN                       equ 0000h
ADUTHL_ADUTH0_POSITION                   equ 0000h
ADUTHL_ADUTH0_SIZE                       equ 0001h
ADUTHL_ADUTH0_LENGTH                     equ 0001h
ADUTHL_ADUTH0_MASK                       equ 0001h
ADUTHL_ADUTH1_POSN                       equ 0001h
ADUTHL_ADUTH1_POSITION                   equ 0001h
ADUTHL_ADUTH1_SIZE                       equ 0001h
ADUTHL_ADUTH1_LENGTH                     equ 0001h
ADUTHL_ADUTH1_MASK                       equ 0002h
ADUTHL_ADUTH2_POSN                       equ 0002h
ADUTHL_ADUTH2_POSITION                   equ 0002h
ADUTHL_ADUTH2_SIZE                       equ 0001h
ADUTHL_ADUTH2_LENGTH                     equ 0001h
ADUTHL_ADUTH2_MASK                       equ 0004h
ADUTHL_ADUTH3_POSN                       equ 0003h
ADUTHL_ADUTH3_POSITION                   equ 0003h
ADUTHL_ADUTH3_SIZE                       equ 0001h
ADUTHL_ADUTH3_LENGTH                     equ 0001h
ADUTHL_ADUTH3_MASK                       equ 0008h
ADUTHL_ADUTH4_POSN                       equ 0004h
ADUTHL_ADUTH4_POSITION                   equ 0004h
ADUTHL_ADUTH4_SIZE                       equ 0001h
ADUTHL_ADUTH4_LENGTH                     equ 0001h
ADUTHL_ADUTH4_MASK                       equ 0010h
ADUTHL_ADUTH5_POSN                       equ 0005h
ADUTHL_ADUTH5_POSITION                   equ 0005h
ADUTHL_ADUTH5_SIZE                       equ 0001h
ADUTHL_ADUTH5_LENGTH                     equ 0001h
ADUTHL_ADUTH5_MASK                       equ 0020h
ADUTHL_ADUTH6_POSN                       equ 0006h
ADUTHL_ADUTH6_POSITION                   equ 0006h
ADUTHL_ADUTH6_SIZE                       equ 0001h
ADUTHL_ADUTH6_LENGTH                     equ 0001h
ADUTHL_ADUTH6_MASK                       equ 0040h
ADUTHL_ADUTH7_POSN                       equ 0007h
ADUTHL_ADUTH7_POSITION                   equ 0007h
ADUTHL_ADUTH7_SIZE                       equ 0001h
ADUTHL_ADUTH7_LENGTH                     equ 0001h
ADUTHL_ADUTH7_MASK                       equ 0080h

// Register: ADUTHH
#define ADUTHH ADUTHH
ADUTHH                                   equ 0F68h
// bitfield definitions
ADUTHH_ADUTHH_POSN                       equ 0000h
ADUTHH_ADUTHH_POSITION                   equ 0000h
ADUTHH_ADUTHH_SIZE                       equ 0008h
ADUTHH_ADUTHH_LENGTH                     equ 0008h
ADUTHH_ADUTHH_MASK                       equ 00FFh
ADUTHH_ADUTH8_POSN                       equ 0000h
ADUTHH_ADUTH8_POSITION                   equ 0000h
ADUTHH_ADUTH8_SIZE                       equ 0001h
ADUTHH_ADUTH8_LENGTH                     equ 0001h
ADUTHH_ADUTH8_MASK                       equ 0001h
ADUTHH_ADUTH9_POSN                       equ 0001h
ADUTHH_ADUTH9_POSITION                   equ 0001h
ADUTHH_ADUTH9_SIZE                       equ 0001h
ADUTHH_ADUTH9_LENGTH                     equ 0001h
ADUTHH_ADUTH9_MASK                       equ 0002h
ADUTHH_ADUTH10_POSN                      equ 0002h
ADUTHH_ADUTH10_POSITION                  equ 0002h
ADUTHH_ADUTH10_SIZE                      equ 0001h
ADUTHH_ADUTH10_LENGTH                    equ 0001h
ADUTHH_ADUTH10_MASK                      equ 0004h
ADUTHH_ADUTH11_POSN                      equ 0003h
ADUTHH_ADUTH11_POSITION                  equ 0003h
ADUTHH_ADUTH11_SIZE                      equ 0001h
ADUTHH_ADUTH11_LENGTH                    equ 0001h
ADUTHH_ADUTH11_MASK                      equ 0008h
ADUTHH_ADUTH12_POSN                      equ 0004h
ADUTHH_ADUTH12_POSITION                  equ 0004h
ADUTHH_ADUTH12_SIZE                      equ 0001h
ADUTHH_ADUTH12_LENGTH                    equ 0001h
ADUTHH_ADUTH12_MASK                      equ 0010h
ADUTHH_ADUTH13_POSN                      equ 0005h
ADUTHH_ADUTH13_POSITION                  equ 0005h
ADUTHH_ADUTH13_SIZE                      equ 0001h
ADUTHH_ADUTH13_LENGTH                    equ 0001h
ADUTHH_ADUTH13_MASK                      equ 0020h
ADUTHH_ADUTH14_POSN                      equ 0006h
ADUTHH_ADUTH14_POSITION                  equ 0006h
ADUTHH_ADUTH14_SIZE                      equ 0001h
ADUTHH_ADUTH14_LENGTH                    equ 0001h
ADUTHH_ADUTH14_MASK                      equ 0040h
ADUTHH_ADUTH15_POSN                      equ 0007h
ADUTHH_ADUTH15_POSITION                  equ 0007h
ADUTHH_ADUTH15_SIZE                      equ 0001h
ADUTHH_ADUTH15_LENGTH                    equ 0001h
ADUTHH_ADUTH15_MASK                      equ 0080h

// Register: ADERR
#define ADERR ADERR
ADERR                                    equ 0F69h

