GopalSaraf/Practicals/PSDL/include/proc/pic18f26q10.inc
#define RA1                              BANKMASK(PORTA), 1, a
#define RA1PPS0                          BANKMASK(RA1PPS), 0, b
#define RA1PPS1                          BANKMASK(RA1PPS), 1, b
#define RA1PPS2                          BANKMASK(RA1PPS), 2, b
#define RA1PPS3                          BANKMASK(RA1PPS), 3, b
#define RA1PPS4                          BANKMASK(RA1PPS), 4, b
#define RA2                              BANKMASK(PORTA), 2, a
#define RA2PPS0                          BANKMASK(RA2PPS), 0, b
#define RA2PPS1                          BANKMASK(RA2PPS), 1, b
#define RA2PPS2                          BANKMASK(RA2PPS), 2, b
#define RA2PPS3                          BANKMASK(RA2PPS), 3, b
#define RA2PPS4                          BANKMASK(RA2PPS), 4, b
#define RA3                              BANKMASK(PORTA), 3, a
#define RA3PPS0                          BANKMASK(RA3PPS), 0, b
#define RA3PPS1                          BANKMASK(RA3PPS), 1, b
#define RA3PPS2                          BANKMASK(RA3PPS), 2, b
#define RA3PPS3                          BANKMASK(RA3PPS), 3, b
#define RA3PPS4                          BANKMASK(RA3PPS), 4, b
#define RA4                              BANKMASK(PORTA), 4, a
#define RA4PPS0                          BANKMASK(RA4PPS), 0, b
#define RA4PPS1                          BANKMASK(RA4PPS), 1, b
#define RA4PPS2                          BANKMASK(RA4PPS), 2, b
#define RA4PPS3                          BANKMASK(RA4PPS), 3, b
#define RA4PPS4                          BANKMASK(RA4PPS), 4, b
#define RA5                              BANKMASK(PORTA), 5, a
#define RA5PPS0                          BANKMASK(RA5PPS), 0, b
#define RA5PPS1                          BANKMASK(RA5PPS), 1, b
#define RA5PPS2                          BANKMASK(RA5PPS), 2, b
#define RA5PPS3                          BANKMASK(RA5PPS), 3, b
#define RA5PPS4                          BANKMASK(RA5PPS), 4, b
#define RA6                              BANKMASK(PORTA), 6, a
#define RA6PPS0                          BANKMASK(RA6PPS), 0, b
#define RA6PPS1                          BANKMASK(RA6PPS), 1, b
#define RA6PPS2                          BANKMASK(RA6PPS), 2, b
#define RA6PPS3                          BANKMASK(RA6PPS), 3, b
#define RA6PPS4                          BANKMASK(RA6PPS), 4, b
#define RA7                              BANKMASK(PORTA), 7, a
#define RA7PPS0                          BANKMASK(RA7PPS), 0, b
#define RA7PPS1                          BANKMASK(RA7PPS), 1, b
#define RA7PPS2                          BANKMASK(RA7PPS), 2, b
#define RA7PPS3                          BANKMASK(RA7PPS), 3, b
#define RA7PPS4                          BANKMASK(RA7PPS), 4, b
#define RB0                              BANKMASK(PORTB), 0, a
#define RB0PPS0                          BANKMASK(RB0PPS), 0, b
#define RB0PPS1                          BANKMASK(RB0PPS), 1, b
#define RB0PPS2                          BANKMASK(RB0PPS), 2, b
#define RB0PPS3                          BANKMASK(RB0PPS), 3, b
#define RB0PPS4                          BANKMASK(RB0PPS), 4, b
#define RB1                              BANKMASK(PORTB), 1, a
#define RB1PPS0                          BANKMASK(RB1PPS), 0, b
#define RB1PPS1                          BANKMASK(RB1PPS), 1, b
#define RB1PPS2                          BANKMASK(RB1PPS), 2, b
#define RB1PPS3                          BANKMASK(RB1PPS), 3, b
#define RB1PPS4                          BANKMASK(RB1PPS), 4, b
#define RB2                              BANKMASK(PORTB), 2, a
#define RB2PPS0                          BANKMASK(RB2PPS), 0, b
#define RB2PPS1                          BANKMASK(RB2PPS), 1, b
#define RB2PPS2                          BANKMASK(RB2PPS), 2, b
#define RB2PPS3                          BANKMASK(RB2PPS), 3, b
#define RB2PPS4                          BANKMASK(RB2PPS), 4, b
#define RB3                              BANKMASK(PORTB), 3, a
#define RB3PPS0                          BANKMASK(RB3PPS), 0, b
#define RB3PPS1                          BANKMASK(RB3PPS), 1, b
#define RB3PPS2                          BANKMASK(RB3PPS), 2, b
#define RB3PPS3                          BANKMASK(RB3PPS), 3, b
#define RB3PPS4                          BANKMASK(RB3PPS), 4, b
#define RB4                              BANKMASK(PORTB), 4, a
#define RB4PPS0                          BANKMASK(RB4PPS), 0, b
#define RB4PPS1                          BANKMASK(RB4PPS), 1, b
#define RB4PPS2                          BANKMASK(RB4PPS), 2, b
#define RB4PPS3                          BANKMASK(RB4PPS), 3, b
#define RB4PPS4                          BANKMASK(RB4PPS), 4, b
#define RB5                              BANKMASK(PORTB), 5, a
#define RB5PPS0                          BANKMASK(RB5PPS), 0, b
#define RB5PPS1                          BANKMASK(RB5PPS), 1, b
#define RB5PPS2                          BANKMASK(RB5PPS), 2, b
#define RB5PPS3                          BANKMASK(RB5PPS), 3, b
#define RB5PPS4                          BANKMASK(RB5PPS), 4, b
#define RB6                              BANKMASK(PORTB), 6, a
#define RB6PPS0                          BANKMASK(RB6PPS), 0, b
#define RB6PPS1                          BANKMASK(RB6PPS), 1, b
#define RB6PPS2                          BANKMASK(RB6PPS), 2, b
#define RB6PPS3                          BANKMASK(RB6PPS), 3, b
#define RB6PPS4                          BANKMASK(RB6PPS), 4, b
#define RB7                              BANKMASK(PORTB), 7, a
#define RB7PPS0                          BANKMASK(RB7PPS), 0, b
#define RB7PPS1                          BANKMASK(RB7PPS), 1, b
#define RB7PPS2                          BANKMASK(RB7PPS), 2, b
#define RB7PPS3                          BANKMASK(RB7PPS), 3, b
#define RB7PPS4                          BANKMASK(RB7PPS), 4, b
#define RC0                              BANKMASK(PORTC), 0, a
#define RC0PPS0                          BANKMASK(RC0PPS), 0, b
#define RC0PPS1                          BANKMASK(RC0PPS), 1, b
#define RC0PPS2                          BANKMASK(RC0PPS), 2, b
#define RC0PPS3                          BANKMASK(RC0PPS), 3, b
#define RC0PPS4                          BANKMASK(RC0PPS), 4, b
#define RC1                              BANKMASK(PORTC), 1, a
#define RC1IE                            BANKMASK(PIE3), 5, b
#define RC1IF                            BANKMASK(PIR3), 5, b
#define RC1IP                            BANKMASK(IPR3), 5, b
#define RC1PPS0                          BANKMASK(RC1PPS), 0, b
#define RC1PPS1                          BANKMASK(RC1PPS), 1, b
#define RC1PPS2                          BANKMASK(RC1PPS), 2, b
#define RC1PPS3                          BANKMASK(RC1PPS), 3, b
#define RC1PPS4                          BANKMASK(RC1PPS), 4, b
#define RC2                              BANKMASK(PORTC), 2, a
#define RC2IE                            BANKMASK(PIE3), 7, b
#define RC2IF                            BANKMASK(PIR3), 7, b
#define RC2IP                            BANKMASK(IPR3), 7, b
#define RC2PPS0                          BANKMASK(RC2PPS), 0, b
#define RC2PPS1                          BANKMASK(RC2PPS), 1, b
#define RC2PPS2                          BANKMASK(RC2PPS), 2, b
#define RC2PPS3                          BANKMASK(RC2PPS), 3, b
#define RC2PPS4                          BANKMASK(RC2PPS), 4, b
#define RC3                              BANKMASK(PORTC), 3, a
#define RC3PPS0                          BANKMASK(RC3PPS), 0, b
#define RC3PPS1                          BANKMASK(RC3PPS), 1, b
#define RC3PPS2                          BANKMASK(RC3PPS), 2, b
#define RC3PPS3                          BANKMASK(RC3PPS), 3, b
#define RC3PPS4                          BANKMASK(RC3PPS), 4, b
#define RC4                              BANKMASK(PORTC), 4, a
#define RC4PPS0                          BANKMASK(RC4PPS), 0, b
#define RC4PPS1                          BANKMASK(RC4PPS), 1, b
#define RC4PPS2                          BANKMASK(RC4PPS), 2, b
#define RC4PPS3                          BANKMASK(RC4PPS), 3, b
#define RC4PPS4                          BANKMASK(RC4PPS), 4, b
#define RC5                              BANKMASK(PORTC), 5, a
#define RC5PPS0                          BANKMASK(RC5PPS), 0, b
#define RC5PPS1                          BANKMASK(RC5PPS), 1, b
#define RC5PPS2                          BANKMASK(RC5PPS), 2, b
#define RC5PPS3                          BANKMASK(RC5PPS), 3, b
#define RC5PPS4                          BANKMASK(RC5PPS), 4, b
#define RC6                              BANKMASK(PORTC), 6, a
#define RC6PPS0                          BANKMASK(RC6PPS), 0, b
#define RC6PPS1                          BANKMASK(RC6PPS), 1, b
#define RC6PPS2                          BANKMASK(RC6PPS), 2, b
#define RC6PPS3                          BANKMASK(RC6PPS), 3, b
#define RC6PPS4                          BANKMASK(RC6PPS), 4, b
#define RC7                              BANKMASK(PORTC), 7, a
#define RC7PPS0                          BANKMASK(RC7PPS), 0, b
#define RC7PPS1                          BANKMASK(RC7PPS), 1, b
#define RC7PPS2                          BANKMASK(RC7PPS), 2, b
#define RC7PPS3                          BANKMASK(RC7PPS), 3, b
#define RC7PPS4                          BANKMASK(RC7PPS), 4, b
#define RCEN1                            BANKMASK(SSP1CON2), 3, a
#define RCEN2                            BANKMASK(SSP2CON2), 3, b
#define RCIE                             BANKMASK(PIE3), 5, b
#define RCIF                             BANKMASK(PIR3), 5, b
#define RCIP                             BANKMASK(IPR3), 5, b
#define RCM                              BANKMASK(PCON1), 0, a
#define RD                               BANKMASK(NVMCON1), 0, a
#define RD161                            BANKMASK(T1CON), 1, a
#define RD163                            BANKMASK(T3CON), 1, a
#define RD165                            BANKMASK(T5CON), 1, a
#define RE3                              BANKMASK(PORTE), 3, a
#define READ_WRITE1                      BANKMASK(SSP1STAT), 2, a
#define READ_WRITE2                      BANKMASK(SSP2STAT), 2, b
#define REN                              BANKMASK(CWG1AS0), 6, b
#define RI                               BANKMASK(PCON0), 2, a
#define RMCLR                            BANKMASK(PCON0), 3, a
#define ROI                              BANKMASK(CPUDOZE), 5, b
#define RSEN1                            BANKMASK(SSP1CON2), 1, a
#define RSEN2                            BANKMASK(SSP2CON2), 1, b
#define RVREG                            BANKMASK(PCON1), 2, a
#define RW1                              BANKMASK(SSP1STAT), 2, a
#define RW2                              BANKMASK(SSP2STAT), 2, b
#define RWDT                             BANKMASK(PCON0), 4, a
#define RX2PPS0                          BANKMASK(RX2PPS), 0, b
#define RX2PPS1                          BANKMASK(RX2PPS), 1, b
#define RX2PPS2                          BANKMASK(RX2PPS), 2, b
#define RX2PPS3                          BANKMASK(RX2PPS), 3, b
#define RX2PPS4                          BANKMASK(RX2PPS), 4, b
#define RXPPS0                           BANKMASK(RX1PPS), 0, b
#define RXPPS1                           BANKMASK(RX1PPS), 1, b
#define RXPPS2                           BANKMASK(RX1PPS), 2, b
#define RXPPS3                           BANKMASK(RX1PPS), 3, b
#define RXPPS4                           BANKMASK(RX1PPS), 4, b
#define R_NOT_W1                         BANKMASK(SSP1STAT), 2, a
#define R_NOT_W2                         BANKMASK(SSP2STAT), 2, b
#define R_W1                             BANKMASK(SSP1STAT), 2, a
#define R_W2                             BANKMASK(SSP2STAT), 2, b
#define R_nW1                            BANKMASK(SSP1STAT), 2, a
#define R_nW2                            BANKMASK(SSP2STAT), 2, b
#define SBOREN                           BANKMASK(BORCON), 7, b
#define SCANBUSY                         BANKMASK(SCANCON0), 5, b
#define SCANEN                           BANKMASK(SCANCON0), 7, b
#define SCANGO                           BANKMASK(SCANCON0), 6, b
#define SCANHADR0                        BANKMASK(SCANHADRL), 0, b
#define SCANHADR1                        BANKMASK(SCANHADRL), 1, b
#define SCANHADR10                       BANKMASK(SCANHADRH), 2, b
#define SCANHADR11                       BANKMASK(SCANHADRH), 3, b
#define SCANHADR12                       BANKMASK(SCANHADRH), 4, b
#define SCANHADR13                       BANKMASK(SCANHADRH), 5, b
#define SCANHADR14                       BANKMASK(SCANHADRH), 6, b
#define SCANHADR15                       BANKMASK(SCANHADRH), 7, b
#define SCANHADR16                       BANKMASK(SCANHADRU), 0, b
#define SCANHADR17                       BANKMASK(SCANHADRU), 1, b
#define SCANHADR18                       BANKMASK(SCANHADRU), 2, b
#define SCANHADR19                       BANKMASK(SCANHADRU), 3, b
#define SCANHADR2                        BANKMASK(SCANHADRL), 2, b
#define SCANHADR20                       BANKMASK(SCANHADRU), 4, b
#define SCANHADR21                       BANKMASK(SCANHADRU), 5, b
#define SCANHADR3                        BANKMASK(SCANHADRL), 3, b
#define SCANHADR4                        BANKMASK(SCANHADRL), 4, b
#define SCANHADR5                        BANKMASK(SCANHADRL), 5, b
#define SCANHADR6                        BANKMASK(SCANHADRL), 6, b
#define SCANHADR7                        BANKMASK(SCANHADRL), 7, b
#define SCANHADR8                        BANKMASK(SCANHADRH), 0, b
#define SCANHADR9                        BANKMASK(SCANHADRH), 1, b
#define SCANIE                           BANKMASK(PIE7), 7, b
#define SCANIF                           BANKMASK(PIR7), 7, b
#define SCANINTM                         BANKMASK(SCANCON0), 3, b
#define SCANINVALID                      BANKMASK(SCANCON0), 4, b
#define SCANIP                           BANKMASK(IPR7), 7, b
#define SCANLADR0                        BANKMASK(SCANLADRL), 0, b
#define SCANLADR1                        BANKMASK(SCANLADRL), 1, b
#define SCANLADR10                       BANKMASK(SCANLADRH), 2, b
#define SCANLADR11                       BANKMASK(SCANLADRH), 3, b
#define SCANLADR12                       BANKMASK(SCANLADRH), 4, b
#define SCANLADR13                       BANKMASK(SCANLADRH), 5, b
#define SCANLADR14                       BANKMASK(SCANLADRH), 6, b
#define SCANLADR15                       BANKMASK(SCANLADRH), 7, b
#define SCANLADR16                       BANKMASK(SCANLADRU), 0, b
#define SCANLADR17                       BANKMASK(SCANLADRU), 1, b
#define SCANLADR18                       BANKMASK(SCANLADRU), 2, b
#define SCANLADR19                       BANKMASK(SCANLADRU), 3, b
#define SCANLADR2                        BANKMASK(SCANLADRL), 2, b
#define SCANLADR20                       BANKMASK(SCANLADRU), 4, b
#define SCANLADR21                       BANKMASK(SCANLADRU), 5, b
#define SCANLADR3                        BANKMASK(SCANLADRL), 3, b
#define SCANLADR4                        BANKMASK(SCANLADRL), 4, b
#define SCANLADR5                        BANKMASK(SCANLADRL), 5, b
#define SCANLADR6                        BANKMASK(SCANLADRL), 6, b
#define SCANLADR7                        BANKMASK(SCANLADRL), 7, b
#define SCANLADR8                        BANKMASK(SCANLADRH), 0, b
#define SCANLADR9                        BANKMASK(SCANLADRH), 1, b
#define SCANMD                           BANKMASK(PMD0), 3, b
#define SCANMODE0                        BANKMASK(SCANCON0), 0, b
#define SCANMODE1                        BANKMASK(SCANCON0), 1, b
#define SCANTSEL0                        BANKMASK(SCANTRIG), 0, b
#define SCANTSEL1                        BANKMASK(SCANTRIG), 1, b
#define SCANTSEL2                        BANKMASK(SCANTRIG), 2, b
#define SCANTSEL3                        BANKMASK(SCANTRIG), 3, b
#define SECER                            BANKMASK(NVMCON1), 6, a
#define SECRD                            BANKMASK(NVMCON1), 1, a
#define SECWR                            BANKMASK(NVMCON1), 5, a
#define SEL0                             BANKMASK(HLVDCON1), 0, b
#define SEL1                             BANKMASK(HLVDCON1), 1, b
#define SEL2                             BANKMASK(HLVDCON1), 2, b
#define SEL3                             BANKMASK(HLVDCON1), 3, b
#define SEN1                             BANKMASK(SSP1CON2), 0, a
#define SEN2                             BANKMASK(SSP2CON2), 0, b
#define SHFT0                            BANKMASK(CRCSHIFTL), 0, a
#define SHFT1                            BANKMASK(CRCSHIFTL), 1, a
#define SHFT10                           BANKMASK(CRCSHIFTH), 2, a
#define SHFT11                           BANKMASK(CRCSHIFTH), 3, a
#define SHFT12                           BANKMASK(CRCSHIFTH), 4, a
#define SHFT13                           BANKMASK(CRCSHIFTH), 5, a
#define SHFT14                           BANKMASK(CRCSHIFTH), 6, a
#define SHFT15                           BANKMASK(CRCSHIFTH), 7, a
#define SHFT2                            BANKMASK(CRCSHIFTL), 2, a
#define SHFT3                            BANKMASK(CRCSHIFTL), 3, a
#define SHFT4                            BANKMASK(CRCSHIFTL), 4, a
#define SHFT5                            BANKMASK(CRCSHIFTL), 5, a
#define SHFT6                            BANKMASK(CRCSHIFTL), 6, a
#define SHFT7                            BANKMASK(CRCSHIFTL), 7, a
#define SHFT8                            BANKMASK(CRCSHIFTH), 0, a
#define SHFT9                            BANKMASK(CRCSHIFTH), 1, a
#define SHIFTM                           BANKMASK(CRCCON0), 1, a
#define SHUTDOWN                         BANKMASK(CWG1AS0), 7, b
#define SLRA0                            BANKMASK(SLRCONA), 0, b
#define SLRA1                            BANKMASK(SLRCONA), 1, b
#define SLRA2                            BANKMASK(SLRCONA), 2, b
#define SLRA3                            BANKMASK(SLRCONA), 3, b
#define SLRA4                            BANKMASK(SLRCONA), 4, b
#define SLRA5                            BANKMASK(SLRCONA), 5, b
#define SLRA6                            BANKMASK(SLRCONA), 6, b
#define SLRA7                            BANKMASK(SLRCONA), 7, b
#define SLRB0                            BANKMASK(SLRCONB), 0, b
#define SLRB1                            BANKMASK(SLRCONB), 1, b
#define SLRB2                            BANKMASK(SLRCONB), 2, b
#define SLRB3                            BANKMASK(SLRCONB), 3, b
#define SLRB4                            BANKMASK(SLRCONB), 4, b
#define SLRB5                            BANKMASK(SLRCONB), 5, b
#define SLRB6                            BANKMASK(SLRCONB), 6, b
#define SLRB7                            BANKMASK(SLRCONB), 7, b
#define SLRC0                            BANKMASK(SLRCONC), 0, b
#define SLRC1                            BANKMASK(SLRCONC), 1, b
#define SLRC2                            BANKMASK(SLRCONC), 2, b
#define SLRC3                            BANKMASK(SLRCONC), 3, b
#define SLRC4                            BANKMASK(SLRCONC), 4, b
#define SLRC5                            BANKMASK(SLRCONC), 5, b
#define SLRC6                            BANKMASK(SLRCONC), 6, b
#define SLRC7                            BANKMASK(SLRCONC), 7, b
#define SMP1                             BANKMASK(SSP1STAT), 7, a
#define SMP2                             BANKMASK(SSP2STAT), 7, b
#define SOR                              BANKMASK(OSCSTAT), 3, b
#define SOSCEN                           BANKMASK(OSCEN), 3, b
#define SOSCPWR                          BANKMASK(OSCCON3), 6, b
#define SP0                              BANKMASK(STKPTR), 0, a
#define SP1                              BANKMASK(STKPTR), 1, a
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SP5                              BANKMASK(STKPTR), 5, a
#define SPI1MD                           BANKMASK(PMD0), 1, b
#define SPI2MD                           BANKMASK(PMD0), 2, b
#define SRCS0                            BANKMASK(MDSRC), 0, b
#define SRCS1                            BANKMASK(MDSRC), 1, b
#define SRCS2                            BANKMASK(MDSRC), 2, b
#define SRCS3                            BANKMASK(MDSRC), 3, b
#define SSP1CLKPPS0                      BANKMASK(SSP1CLKPPS), 0, b
#define SSP1CLKPPS1                      BANKMASK(SSP1CLKPPS), 1, b
#define SSP1CLKPPS2                      BANKMASK(SSP1CLKPPS), 2, b
#define SSP1CLKPPS3                      BANKMASK(SSP1CLKPPS), 3, b
#define SSP1CLKPPS4                      BANKMASK(SSP1CLKPPS), 4, b
#define SSP1DATPPS0                      BANKMASK(SSP1DATPPS), 0, b
#define SSP1DATPPS1                      BANKMASK(SSP1DATPPS), 1, b
#define SSP1DATPPS2                      BANKMASK(SSP1DATPPS), 2, b
#define SSP1DATPPS3                      BANKMASK(SSP1DATPPS), 3, b
#define SSP1DATPPS4                      BANKMASK(SSP1DATPPS), 4, b
#define SSP1IE                           BANKMASK(PIE3), 0, b
#define SSP1IF                           BANKMASK(PIR3), 0, b
#define SSP1IP                           BANKMASK(IPR3), 0, b
#define SSP1SSPPS0                       BANKMASK(SSP1SSPPS), 0, b
#define SSP1SSPPS1                       BANKMASK(SSP1SSPPS), 1, b
#define SSP1SSPPS2                       BANKMASK(SSP1SSPPS), 2, b
#define SSP1SSPPS3                       BANKMASK(SSP1SSPPS), 3, b
#define SSP1SSPPS4                       BANKMASK(SSP1SSPPS), 4, b
#define SSP2CLKPPS0                      BANKMASK(SSP2CLKPPS), 0, b
#define SSP2CLKPPS1                      BANKMASK(SSP2CLKPPS), 1, b
#define SSP2CLKPPS2                      BANKMASK(SSP2CLKPPS), 2, b
#define SSP2CLKPPS3                      BANKMASK(SSP2CLKPPS), 3, b
#define SSP2CLKPPS4                      BANKMASK(SSP2CLKPPS), 4, b
#define SSP2DATPPS0                      BANKMASK(SSP2DATPPS), 0, b
#define SSP2DATPPS1                      BANKMASK(SSP2DATPPS), 1, b
#define SSP2DATPPS2                      BANKMASK(SSP2DATPPS), 2, b
#define SSP2DATPPS3                      BANKMASK(SSP2DATPPS), 3, b
#define SSP2DATPPS4                      BANKMASK(SSP2DATPPS), 4, b
#define SSP2IE                           BANKMASK(PIE3), 2, b
#define SSP2IF                           BANKMASK(PIR3), 2, b
#define SSP2IP                           BANKMASK(IPR3), 2, b
#define SSP2SSPPS0                       BANKMASK(SSP2SSPPS), 0, b
#define SSP2SSPPS1                       BANKMASK(SSP2SSPPS), 1, b
#define SSP2SSPPS2                       BANKMASK(SSP2SSPPS), 2, b
#define SSP2SSPPS3                       BANKMASK(SSP2SSPPS), 3, b
#define SSP2SSPPS4                       BANKMASK(SSP2SSPPS), 4, b
#define SSPCLKPPS0                       BANKMASK(SSP1CLKPPS), 0, b
#define SSPCLKPPS1                       BANKMASK(SSP1CLKPPS), 1, b
#define SSPCLKPPS2                       BANKMASK(SSP1CLKPPS), 2, b
#define SSPCLKPPS3                       BANKMASK(SSP1CLKPPS), 3, b
#define SSPCLKPPS4                       BANKMASK(SSP1CLKPPS), 4, b
#define SSPDATPPS0                       BANKMASK(SSP1DATPPS), 0, b
#define SSPDATPPS1                       BANKMASK(SSP1DATPPS), 1, b
#define SSPDATPPS2                       BANKMASK(SSP1DATPPS), 2, b
#define SSPDATPPS3                       BANKMASK(SSP1DATPPS), 3, b
#define SSPDATPPS4                       BANKMASK(SSP1DATPPS), 4, b
#define SSPEN1                           BANKMASK(SSP1CON1), 5, a
#define SSPEN2                           BANKMASK(SSP2CON1), 5, b
#define SSPIE                            BANKMASK(PIE3), 0, b
#define SSPIF                            BANKMASK(PIR3), 0, b
#define SSPIP                            BANKMASK(IPR3), 0, b
#define SSPM01                           BANKMASK(SSP1CON1), 0, a
#define SSPM02                           BANKMASK(SSP2CON1), 0, b
#define SSPM11                           BANKMASK(SSP1CON1), 1, a
#define SSPM12                           BANKMASK(SSP2CON1), 1, b
#define SSPM21                           BANKMASK(SSP1CON1), 2, a
#define SSPM22                           BANKMASK(SSP2CON1), 2, b
#define SSPM31                           BANKMASK(SSP1CON1), 3, a
